app/Controllers/Auth.php

INSERT INTO `users` (`name`, `email`, `password`, `role`, `created_at`, `updated_at`) VALUES ('jose rizal', 'jrizz@gmail.com', '$2y$10$1xRPgfzwNV1zJRXT8.vkjeiW194XTODXyaB0pv0Q8ZPXyOgEeZtpW', 'student', '2025-09-04 18:36:29', '2025-09-04 18:36:29')
---
                        return redirect()->to('/register');
                    }

                    $result = $db->table('users')->insert($newData);

SELECT *
FROM `users`
WHERE `email` = 'admin@university.edu'
---
    public function login()
    {
        helper(['form', 'url']);
        $data = [];

        if ($this->request->getMethod() == 'POST') {
            $rules = [
                'email'    => 'required|valid_email',
                'password' => 'required|min_length[6]',
            ];

            if (!$this->validate($rules)) {
                $data['validation'] = $this->validator;
            } else {
                // Validation passed - now check database
                $db = \Config\Database::connect();
                $user = $db->table('users')->where('email', $this->request->getPost('email'))->get()->getRowArray();

SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows` FROM `courses`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `created_at` >= '2025-09-26 18:49:21'
---
    public function dashboard()
    {
        // Check if user is logged in
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $userRole = session()->get('role');
        $userId = session()->get('id');
        $db = \Config\Database::connect();

        // Debug: Check what's in session
        // $sessionData = session()->get();
        // log_message('debug', 'Dashboard Session Data: ' . json_encode($sessionData));

        // Initialize dashboard data
        $dashboardData = [
            'user' => [
                'name' => session()->get('name'),
                'role' => $userRole,
                'email' => session()->get('email')
            ]
        ];

        // Fetch role-specific data
        switch ($userRole) {
            case 'admin':
                $dashboardData['stats'] = [
                    'total_users' => $db->table('users')->countAll(),
                    'total_courses' => $db->table('courses')->countAll(),
                    'recent_registrations' => $db->table('users')
                        ->where('created_at >=', date('Y-m-d H:i:s', strtotime('-7 days')))
                        ->countAllResults(),
                    'active_courses' => $db->table('courses')->countAll()

SELECT COUNT(*) AS `numrows`
FROM `submissions`
WHERE `user_id` = '4'
SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `user_id` = '16'
SELECT COUNT(*) AS `numrows`
FROM `submissions`
WHERE `user_id` = '16'
SELECT AVG(`score`) AS `score`
FROM `submissions`
WHERE `user_id` = '16'
AND `score` IS NOT NULL
---

            case 'student':
            default:
                $dashboardData['stats'] = [
                    'enrolled_courses' => $db->table('enrollments')
                        ->where('user_id', $userId)
                        ->countAllResults(),
                    'completed_courses' => 0,
                    'total_submissions' => $db->table('submissions')
                        ->where('user_id', $userId)
                        ->countAllResults(),
                    'average_grade' => $db->table('submissions')
                        ->selectAvg('score')
                        ->where('user_id', $userId)
                        ->where('score IS NOT NULL')
                        ->get()
                        ->getRow()
                        ->score ?? 0
                ];