app/Controllers/Auth.php

                    'total_submissions' => $db->table('submissions')
                        ->where('user_id', $userId)
                        ->countAllResults(),
                    'average_grade' => $db->table('submissions')
                        ->selectAvg('score')
                        ->where('user_id', $userId)
                        ->where('score IS NOT NULL')
                        ->get()
                        ->getRow()
                        ->score ?? 0
---
SELECT AVG(`score`) AS `score`
FROM `submissions`
WHERE `user_id` = '4'
AND `score` IS NOT NULL