app/Controllers/Course.php

    public function enroll()
    {
        // Check if user is logged in
        if (!session()->get('isLoggedIn')) {
            return $this->respond([
                'success' => false,
                'message' => 'Please login to enroll in courses'
            ], 401);
        }

        // Get course_id from POST request
        $courseId = $this->request->getPost('course_id');

        if (!$courseId) {
            return $this->respond([
                'success' => false,
                'message' => 'Course ID is required'
            ], 400);
        }

        // Validate course exists
        $courseModel = new CourseModel();
        $course = $courseModel->find($courseId);
---
SELECT *
FROM `courses`
WHERE `courses`.`id` = '7'