app/Models/CourseModel.php

    public function getAllCourses()
    {
        return $this->select('courses.*, users.name as instructor_name')
                    ->join('users', 'users.id = courses.instructor_id', 'left')
                    ->findAll();
---
SELECT `courses`.*, `users`.`name` as `instructor_name`
FROM `courses`
LEFT JOIN `users` ON `users`.`id` = `courses`.`instructor_id`

    public function getCoursesWithEnrollmentCount()
    {
        return $this->select('courses.*, users.name as instructor_name, COUNT(enrollments.id) as enrollment_count')
                    ->join('users', 'users.id = courses.instructor_id', 'left')
                    ->join('enrollments', 'enrollments.course_id = courses.id', 'left')
                    ->groupBy('courses.id')
                    ->findAll();
---
SELECT `courses`.*, `users`.`name` as `instructor_name`, COUNT(enrollments.id) as enrollment_count
FROM `courses`
LEFT JOIN `users` ON `users`.`id` = `courses`.`instructor_id`
LEFT JOIN `enrollments` ON `enrollments`.`course_id` = `courses`.`id`
GROUP BY `courses`.`id`