app/Models/EnrollmentModel.php

INSERT INTO `enrollments` (`user_id`, `course_id`, `enrollment_date`) VALUES ('4', '7', '2025-10-13 17:20:58')
---
    public function enrollUser($data)
    {
        // Check if user is already enrolled
        if ($this->isAlreadyEnrolled($data['user_id'], $data['course_id'])) {
            return false;
        }

        // Set enrollment date if not provided
        if (!isset($data['enrollment_date'])) {
            $data['enrollment_date'] = date('Y-m-d H:i:s');
        }

        return $this->insert($data);

SELECT `enrollments`.*, `courses`.`title` as `course_name`, `courses`.`description`
FROM `enrollments`
JOIN `courses` ON `enrollments`.`course_id` = `courses`.`id`
WHERE `enrollments`.`user_id` = '4'
---
    public function getUserEnrollments($user_id)
    {
        return $this->select('enrollments.*, courses.name as course_name, courses.description')
                    ->join('courses', 'enrollments.course_id = courses.id')
                    ->where('enrollments.user_id', $user_id)
                    ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `user_id` = '4'
AND `course_id` = '7'
---
    public function isAlreadyEnrolled($user_id, $course_id)
    {
        return $this->where('user_id', $user_id)
                    ->where('course_id', $course_id)
                    ->countAllResults() > 0;